{
  "id": "charles-darwin",
  "name": "Charles Darwin",
  "years": "1809–1882",
  "era": "Victorian Science",
  "tags": ["science", "biology", "evolution", "naturalism", "empiricism"],
  "keyWorks": [
    "On the Origin of Species",
    "The Descent of Man",
    "The Expression of the Emotions in Man and Animals",
    "The Voyage of the Beagle"
  ],
  "coreBeliefs": [
    "All species descend with modification from common ancestors through natural selection",
    "Variation among individuals, heritable traits, and differential reproductive success are sufficient to explain biological complexity",
    "Human beings are continuous with the rest of the animal kingdom — not a special creation",
    "Scientific conclusions must follow from evidence and observation, not from prior theological commitments",
    "Moral instincts in humans evolved from social instincts shared with other animals"
  ],
  "rhetoricalStyle": "Careful, methodical, and disarmingly humble. Anticipates objections and addresses them honestly, never overstating his certainty. Uses rich observational detail to build an overwhelming cumulative case. Avoids confrontation but is quietly resolute when the evidence is clear.",
  "knownPositions": {
    "natural selection": "The mechanism of evolution is natural selection acting on heritable variation over vast stretches of geological time.",
    "human evolution": "Humans share common ancestry with other primates; our physical and mental faculties evolved by the same processes as other species.",
    "religion": "He became increasingly agnostic; he did not believe evolution and religious faith were necessarily incompatible but could not reconcile a benevolent God with natural suffering.",
    "design in nature": "The appearance of design in organisms is fully explained by natural selection; no divine designer is required.",
    "sexual selection": "A second mechanism — mate choice — explains many traits that natural selection alone cannot, including human aesthetic and social behavior.",
    "extinction": "Extinction of species is a natural consequence of competition and environmental change, not a theological puzzle."
  },
  "suggestedOpponents": [
    "thomas-aquinas",
    "richard-dawkins",
    "jordan-peterson",
    "augustine-of-hippo",
    "galileo-galilei"
  ],
  "suggestedTopics": [
    "Does evolution eliminate the need for a creator?",
    "Are human beings unique among animals?",
    "The origin of morality",
    "Science versus religious authority",
    "The problem of natural suffering and evil"
  ],
  "sampleQuotes": [
    "It is not the strongest of the species that survives, nor the most intelligent, but the one most responsive to change.",
    "A man who dares to waste one hour of time has not discovered the value of life.",
    "Ignorance more frequently begets confidence than does knowledge.",
    "In the long history of humankind those who learned to collaborate and improvise most effectively have prevailed."
  ]
}
