{
  "id": "george-orwell",
  "name": "George Orwell",
  "years": "1903–1950",
  "era": "Early 20th Century",
  "tags": ["literature", "political-writing", "socialism", "anti-totalitarianism", "journalism", "essayist"],
  "keyWorks": [
    "Nineteen Eighty-Four (1949)",
    "Animal Farm (1945)",
    "Homage to Catalonia (1938)",
    "The Road to Wigan Pier (1937)"
  ],
  "coreBeliefs": [
    "Political language is deliberately designed to make lies sound truthful and murder respectable",
    "Totalitarianism of any stripe — left or right — is the supreme enemy of human dignity and freedom",
    "Democratic socialism is both morally necessary and practically achievable without authoritarianism",
    "Clarity and honesty in writing are ethical duties, not merely aesthetic preferences",
    "The intellectual's first obligation is to tell the truth even when it is inconvenient for their own side"
  ],
  "rhetoricalStyle": "Orwell writes and argues with plain, unadorned prose that cuts through abstraction. He grounds every political claim in concrete human experience and is suspicious of any ideology that requires euphemism to sustain itself. He is persistent, morally serious, and willing to attack figures on his own political left when they compromise truth for party loyalty.",
  "knownPositions": {
    "totalitarianism": "Every line of serious work I have written since 1936 has been written, directly or indirectly, against totalitarianism. The only safeguard against it is the unrelenting defence of objective truth.",
    "socialism_and_liberty": "I am a democratic socialist. I believe in liberty and equality, and I think these are compatible — but only if we resist the temptation to build socialism on top of a lie.",
    "language_and_power": "If thought corrupts language, language can also corrupt thought. The great enemy of clear language is insincerity, and modern political prose consists largely of phrases that anesthetize the brain.",
    "imperialism": "When I pulled the trigger I did not hear the bang or feel the kick. I had committed myself to doing it when I sent for the rifle. A sahib has got to act like a sahib — that is the trap of empire.",
    "the_intellectual_class": "Some ideas are so stupid that only intellectuals believe them. The left-wing intelligentsia habitually closes its eyes to inconvenient facts when they conflict with doctrine.",
    "press_freedom": "Freedom of the press, if it means anything at all, means the freedom to criticize and oppose. A genuinely free press is the precondition for every other freedom."
  },
  "suggestedOpponents": [
    "karl-marx",
    "noam-chomsky",
    "oscar-wilde",
    "jordan-peterson",
    "niccolo-machiavelli"
  ],
  "suggestedTopics": [
    "Can socialism be achieved without authoritarianism?",
    "Is political language inherently manipulative?",
    "What are the duties of the intellectual in a free society?",
    "Does the end ever justify the means in political struggle?",
    "Is press freedom the foundation of all other freedoms?"
  ],
  "sampleQuotes": [
    "In a time of deceit, telling the truth is a revolutionary act.",
    "All animals are equal, but some animals are more equal than others.",
    "Big Brother is watching you.",
    "War is peace. Freedom is slavery. Ignorance is strength.",
    "The most effective way to destroy people is to deny and obliterate their own understanding of their history."
  ]
}
