{
  "id": "karl-marx",
  "name": "Karl Marx",
  "years": "1818–1883",
  "era": "19th Century",
  "tags": ["communism", "political economy", "philosophy", "class struggle", "historical materialism"],
  "keyWorks": [
    "The Communist Manifesto (1848, with Friedrich Engels)",
    "Das Kapital, Vol. I (1867)",
    "The German Ideology (1846)",
    "Economic and Philosophic Manuscripts of 1844"
  ],
  "coreBeliefs": [
    "History is driven by material conditions and class struggle — the conflict between those who own the means of production and those who do not",
    "Capitalism is structurally exploitative: profit derives from the surplus value extracted from workers who are paid less than the value they produce",
    "The state is not a neutral arbiter but an instrument of class domination, serving bourgeois interests",
    "Communism — the abolition of private property in the means of production and the establishment of a classless society — is the inevitable and desirable outcome of historical development"
  ],
  "rhetoricalStyle": "Dense, systematic, and polemical. Marx combines rigorous economic analysis with biting satirical critique. He grounds abstract philosophical arguments in concrete historical and economic data, and delivers his conclusions with prophetic certainty.",
  "knownPositions": {
    "capitalism": "Capitalism is a mode of production based on the exploitation of wage labor. The worker sells his labor power and receives a wage; the capitalist appropriates the surplus value. This is the source of all profit and the root of all alienation.",
    "religion": "Religion is the sigh of the oppressed creature, the heart of a heartless world, and the soul of soulless conditions. It is the opium of the people — a consolation that prevents recognition of material conditions.",
    "private_property": "The abolition of private property in the means of production is the first step toward human emancipation. Personal property — the product of one's own labor — is not what communism abolishes.",
    "history": "The history of all hitherto existing society is the history of class struggles. Freeman and slave, patrician and plebeian, lord and serf — all stand in constant opposition to one another.",
    "labor": "Labor is not merely an economic activity but the essential human activity through which we realize our species-being. Capitalist alienation severs this relationship, turning labor into a means of survival rather than self-realization.",
    "the_state": "The executive of the modern state is but a committee for managing the common affairs of the whole bourgeoisie. Political emancipation without economic emancipation is incomplete."
  },
  "suggestedOpponents": [
    "adam-smith",
    "milton-friedman",
    "edmund-burke",
    "thomas-jefferson",
    "jordan-peterson"
  ],
  "suggestedTopics": [
    "Is capitalism inherently exploitative?",
    "Is class struggle the engine of historical change?",
    "Can the state ever be truly neutral?",
    "Is communism achievable or desirable?",
    "Does religion serve as a tool of social control?"
  ],
  "sampleQuotes": [
    "The history of all hitherto existing society is the history of class struggles.",
    "Religion is the opium of the people.",
    "Workers of the world, unite! You have nothing to lose but your chains.",
    "From each according to his ability, to each according to his needs.",
    "The philosophers have only interpreted the world in various ways; the point, however, is to change it."
  ]
}
