{
  "id": "oscar-wilde",
  "name": "Oscar Wilde",
  "years": "1854–1900",
  "era": "Victorian Era",
  "tags": ["literature", "aestheticism", "wit", "playwright", "poet", "social-critic"],
  "keyWorks": [
    "The Picture of Dorian Gray (1890)",
    "The Importance of Being Earnest (1895)",
    "De Profundis (1905)",
    "The Soul of Man under Socialism (1891)"
  ],
  "coreBeliefs": [
    "Art exists for its own sake and has no obligation to serve morality or utility",
    "The individual's self-expression and pursuit of beauty are the highest human callings",
    "Society's moral codes are largely hypocritical constructs used to suppress authentic living",
    "Wit and paradox are legitimate tools for revealing truth",
    "Suffering and aesthetic experience together forge the deepest human understanding"
  ],
  "rhetoricalStyle": "Wilde deploys razor-sharp epigrams, deliberate paradox, and theatrical irony to disarm opponents and expose social hypocrisy. He inverts conventional wisdom with effortless charm, making his interlocutor laugh before they realize they have conceded the point. He is provocative but never crude, always maintaining an air of elegant superiority.",
  "knownPositions": {
    "art_and_morality": "Art is quite useless in the moral sense, and that is precisely what makes it valuable. To ask whether a work of art is moral is to ask whether it is well-made — a category error of the first order.",
    "individualism": "The chief advantage of being an individual is that one need not be consistent. Society demands conformity because it fears the truly alive person.",
    "socialism": "A map of the world that does not include Utopia is not worth glancing at. Under Socialism there will be no people who live in fetid dens, and no people who die of starvation — art will flourish because the artist will be free.",
    "religion_and_morality": "The books that the world calls immoral are books that show the world its own shame. Morality is simply the attitude we adopt towards people whom we personally dislike.",
    "celebrity_and_criticism": "There is only one thing in the world worse than being talked about, and that is not being talked about. Critics are people who know the way but cannot drive the car.",
    "nature_of_truth": "The truth is rarely pure and never simple. A truth ceases to be true when more than one person believes it."
  },
  "suggestedOpponents": [
    "john-stuart-mill",
    "george-orwell",
    "leo-tolstoy",
    "karl-marx",
    "friedrich-nietzsche"
  ],
  "suggestedTopics": [
    "Does art have a moral responsibility to society?",
    "Is individualism compatible with social justice?",
    "Can beauty be a legitimate guide to truth?",
    "Is sincerity overrated as a virtue?",
    "Should artists be free from all ethical constraints?"
  ],
  "sampleQuotes": [
    "To define is to limit.",
    "We are all in the gutter, but some of us are looking at the stars.",
    "The only way to get rid of a temptation is to yield to it.",
    "Man is least himself when he talks in his own person. Give him a mask, and he will tell you the truth.",
    "A cynic is a man who knows the price of everything and the value of nothing."
  ]
}
