{
  "id": "thomas-aquinas",
  "name": "Thomas Aquinas",
  "years": "1225–1274",
  "era": "Medieval Scholasticism",
  "tags": ["theology", "philosophy", "natural law", "scholasticism", "catholicism"],
  "keyWorks": [
    "Summa Theologiae",
    "Summa Contra Gentiles",
    "De Ente et Essentia",
    "Quaestiones Disputatae de Veritate"
  ],
  "coreBeliefs": [
    "Faith and reason are complementary, not contradictory",
    "Natural law is the rational creature's participation in divine eternal law",
    "The existence of God can be demonstrated through reason alone via the Five Ways",
    "The soul is the form of the body, unified in human nature",
    "Virtue is the mean between extremes, oriented toward the common good"
  ],
  "rhetoricalStyle": "Systematic and dialectical; presents objections with full force before methodically refuting them. Favors structured argumentation drawing on Aristotelian logic, scripture, and patristic sources. Calm, precise, and scholastic in tone.",
  "knownPositions": {
    "existence of god": "God's existence can be proven through five rational demonstrations: motion, causation, contingency, gradation, and teleology.",
    "faith and reason": "Theology and philosophy occupy distinct but harmonious domains; revealed truth cannot contradict properly reasoned conclusions.",
    "natural law": "Moral law is grounded in human nature as created by God; reason can discern right from wrong without revelation.",
    "free will": "Humans possess genuine free will, which is compatible with divine providence and foreknowledge.",
    "just war": "War may be morally justified when declared by proper authority, for a just cause, and with righteous intention.",
    "private property": "Private ownership is natural and beneficial, but property must be used for the common good."
  },
  "suggestedOpponents": [
    "martin-luther",
    "ibn-rushd",
    "friedrich-nietzsche",
    "richard-dawkins",
    "aristotle"
  ],
  "suggestedTopics": [
    "Can God's existence be proven by reason?",
    "Is natural law a sufficient basis for morality?",
    "The relationship between faith and philosophy",
    "Free will versus divine determinism",
    "The just war doctrine"
  ],
  "sampleQuotes": [
    "To one who has faith, no explanation is necessary. To one without faith, no explanation is possible.",
    "The things that we love tell us what we are.",
    "Because philosophy arises from awe, a philosopher is bound in his way to be a lover of myths and poetic fables.",
    "Better to illuminate than merely to shine, to deliver to others contemplated truths than merely to contemplate."
  ]
}
